---
kind: method
id: M:Autodesk.Revit.DB.Macros.MacroManager.GetMacroManagerIterator
source: html/00849391-fb3b-9381-4b9a-af908024c311.htm
---
# Autodesk.Revit.DB.Macros.MacroManager.GetMacroManagerIterator Method

Returns a Macro manager iterator that iterates through the collection.

## Syntax (C#)
```csharp
public MacroManagerIterator GetMacroManagerIterator()
```

## Returns
A Macro manager iterator object that can be used to iterate through key-value pairs in the collection.